[
  {
    "title": "1984",
    "short": "Dystopia; surveillance; propaganda; control; rebellion; truth; freedom.",
    "full": "George Orwell's novel depicts a dystopian society under total state control, where truth is manipulated and individual freedom is crushed."
  },
  {
    "title": "The Hobbit",
    "short": "Adventure; friendship; courage; journey; fantastical creatures.",
    "full": "Bilbo Baggins, a comfort-loving hobbit, sets out on a quest with dwarves to reclaim the treasure guarded by Smaug."
  },
  {
    "title": "To Kill a Mockingbird",
    "short": "Justice; racism; morality; empathy; coming-of-age.",
    "full": "In the 1930s American South, young Scout Finch watches her father, Atticus, defend an innocent Black man, confronting prejudice and learning empathy."
  },
  {
    "title": "The Catcher in the Rye",
    "short": "Alienation; adolescence; identity; cynicism; innocence.",
    "full": "Holden Caulfield recounts a few turbulent days in New York, searching for meaning and authenticity."
  },
  {
    "title": "Pride and Prejudice",
    "short": "Love; social class; prejudice; family; humor.",
    "full": "Elizabeth Bennet and Mr. Darcy overcome pride and prejudice within a rigid society."
  },
  {
    "title": "Brave New World",
    "short": "Dystopia; conformity; hedonism; technology; liberty vs. stability.",
    "full": "Huxley imagines a standardized world where happiness is manufactured and individuality is suspect."
  },
  {
    "title": "Fahrenheit 451",
    "short": "Dystopia; censorship; books; mass media; moral awakening.",
    "full": "Montag, a fireman who burns books, begins to doubt the system and seeks meaning through reading."
  },
  {
    "title": "The Lord of the Rings",
    "short": "Epic fantasy; friendship; sacrifice; good vs. evil; journey.",
    "full": "An unlikely fellowship seeks to destroy the One Ring to save Middle-earth."
  },
  {
    "title": "A Game of Thrones",
    "short": "Fantasy; politics; family; war; moral ambiguity.",
    "full": "The noble houses of Westeros vie for the Iron Throne as ancient threats return from the north."
  },
  {
    "title": "The Book Thief",
    "short": "War; Nazi Germany; the power of words; loss; humanity.",
    "full": "Death narrates the life of Liesel, a girl who steals books and finds hope amid the horrors of war."
  },
  {
    "title": "The Name of the Wind",
    "short": "Magic; legend; identity; art; storytelling.",
    "full": "Kvothe recounts his life, from orphaned child to prodigious student at a university of magic."
  },
  {
    "title": "All Quiet on the Western Front",
    "short": "War; trauma; camaraderie; disillusionment.",
    "full": "A young German soldier endures the absurdity of the trenches in World War I."
  }
]
